k6/results/kafka/04-throughput.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/04-throughput.js
        output: json (k6/results/kafka/04-throughput.json)

     scenarios: (100.00%) 1 scenario, 100 max VUs, 6m0s max duration (incl. graceful stop):
              * throughput_ramp: Up to 100 looping VUs for 5m30s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 000/100 VUs, 0 complete and 0 interrupted iterations
throughput_ramp   [   0% ] 000/100 VUs  0m00.8s/5m30.0s

running (0m02.0s), 000/100 VUs, 0 complete and 0 interrupted iterations
throughput_ramp   [   1% ] 000/100 VUs  0m01.8s/5m30.0s

running (0m03.0s), 000/100 VUs, 0 complete and 0 interrupted iterations
throughput_ramp   [   1% ] 000/100 VUs  0m02.8s/5m30.0s

running (0m04.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
throughput_ramp   [   1% ] 001/100 VUs  0m03.8s/5m30.0s

running (0m05.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
throughput_ramp   [   1% ] 001/100 VUs  0m04.8s/5m30.0s

running (0m06.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
throughput_ramp   [   2% ] 001/100 VUs  0m05.8s/5m30.0s

running (0m07.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
throughput_ramp   [   2% ] 002/100 VUs  0m06.8s/5m30.0s

running (0m08.0s), 002/100 VUs, 3 complete and 0 interrupted iterations
throughput_ramp   [   2% ] 002/100 VUs  0m07.8s/5m30.0s

running (0m09.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
throughput_ramp   [   3% ] 002/100 VUs  0m08.8s/5m30.0s

running (0m10.0s), 003/100 VUs, 5 complete and 0 interrupted iterations
throughput_ramp   [   3% ] 003/100 VUs  0m09.8s/5m30.0s

running (0m11.0s), 003/100 VUs, 7 complete and 0 interrupted iterations
throughput_ramp   [   3% ] 003/100 VUs  0m10.8s/5m30.0s

running (0m12.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
throughput_ramp   [   4% ] 003/100 VUs  0m11.8s/5m30.0s

running (0m13.0s), 004/100 VUs, 10 complete and 0 interrupted iterations
throughput_ramp   [   4% ] 004/100 VUs  0m12.8s/5m30.0s

running (0m14.0s), 004/100 VUs, 13 complete and 0 interrupted iterations
throughput_ramp   [   4% ] 004/100 VUs  0m13.8s/5m30.0s

running (0m15.0s), 004/100 VUs, 15 complete and 0 interrupted iterations
throughput_ramp   [   4% ] 004/100 VUs  0m14.8s/5m30.0s

running (0m16.0s), 005/100 VUs, 18 complete and 0 interrupted iterations
throughput_ramp   [   5% ] 005/100 VUs  0m15.8s/5m30.0s

running (0m17.0s), 005/100 VUs, 20 complete and 0 interrupted iterations
throughput_ramp   [   5% ] 005/100 VUs  0m16.8s/5m30.0s

running (0m18.0s), 005/100 VUs, 23 complete and 0 interrupted iterations
throughput_ramp   [   5% ] 005/100 VUs  0m17.8s/5m30.0s

running (0m19.0s), 006/100 VUs, 26 complete and 0 interrupted iterations
throughput_ramp   [   6% ] 006/100 VUs  0m18.8s/5m30.0s

running (0m20.0s), 006/100 VUs, 28 complete and 0 interrupted iterations
throughput_ramp   [   6% ] 006/100 VUs  0m19.8s/5m30.0s

running (0m21.0s), 006/100 VUs, 34 complete and 0 interrupted iterations
throughput_ramp   [   6% ] 006/100 VUs  0m20.8s/5m30.0s

running (0m22.0s), 007/100 VUs, 35 complete and 0 interrupted iterations
throughput_ramp   [   7% ] 007/100 VUs  0m21.8s/5m30.0s

running (0m23.0s), 007/100 VUs, 40 complete and 0 interrupted iterations
throughput_ramp   [   7% ] 007/100 VUs  0m22.8s/5m30.0s

running (0m24.0s), 007/100 VUs, 43 complete and 0 interrupted iterations
throughput_ramp   [   7% ] 007/100 VUs  0m23.8s/5m30.0s

running (0m25.0s), 008/100 VUs, 48 complete and 0 interrupted iterations
throughput_ramp   [   8% ] 008/100 VUs  0m24.8s/5m30.0s

running (0m26.0s), 008/100 VUs, 51 complete and 0 interrupted iterations
throughput_ramp   [   8% ] 008/100 VUs  0m25.8s/5m30.0s

running (0m27.0s), 008/100 VUs, 56 complete and 0 interrupted iterations
throughput_ramp   [   8% ] 008/100 VUs  0m26.8s/5m30.0s

running (0m28.0s), 009/100 VUs, 59 complete and 0 interrupted iterations
throughput_ramp   [   8% ] 009/100 VUs  0m27.8s/5m30.0s

running (0m29.0s), 009/100 VUs, 62 complete and 0 interrupted iterations
throughput_ramp   [   9% ] 009/100 VUs  0m28.8s/5m30.0s

running (0m30.0s), 009/100 VUs, 68 complete and 0 interrupted iterations
throughput_ramp   [   9% ] 009/100 VUs  0m29.8s/5m30.0s

running (0m31.0s), 010/100 VUs, 71 complete and 0 interrupted iterations
throughput_ramp   [   9% ] 010/100 VUs  0m30.8s/5m30.0s

running (0m32.0s), 010/100 VUs, 77 complete and 0 interrupted iterations
throughput_ramp   [  10% ] 010/100 VUs  0m31.8s/5m30.0s

running (0m33.0s), 010/100 VUs, 82 complete and 0 interrupted iterations
throughput_ramp   [  10% ] 010/100 VUs  0m32.8s/5m30.0s

running (0m34.0s), 010/100 VUs, 86 complete and 0 interrupted iterations
throughput_ramp   [  10% ] 010/100 VUs  0m33.8s/5m30.0s

running (0m35.0s), 011/100 VUs, 92 complete and 0 interrupted iterations
throughput_ramp   [  11% ] 011/100 VUs  0m34.8s/5m30.0s

running (0m36.0s), 011/100 VUs, 93 complete and 0 interrupted iterations
throughput_ramp   [  11% ] 011/100 VUs  0m35.8s/5m30.0s

running (0m37.0s), 011/100 VUs, 99 complete and 0 interrupted iterations
throughput_ramp   [  11% ] 011/100 VUs  0m36.8s/5m30.0s

running (0m38.0s), 011/100 VUs, 103 complete and 0 interrupted iterations
throughput_ramp   [  11% ] 011/100 VUs  0m37.8s/5m30.0s

running (0m39.0s), 012/100 VUs, 106 complete and 0 interrupted iterations
throughput_ramp   [  12% ] 012/100 VUs  0m38.8s/5m30.0s

running (0m40.0s), 012/100 VUs, 112 complete and 0 interrupted iterations
throughput_ramp   [  12% ] 012/100 VUs  0m39.8s/5m30.0s

running (0m41.0s), 012/100 VUs, 112 complete and 0 interrupted iterations
throughput_ramp   [  12% ] 012/100 VUs  0m40.8s/5m30.0s

running (0m42.0s), 012/100 VUs, 118 complete and 0 interrupted iterations
throughput_ramp   [  13% ] 012/100 VUs  0m41.8s/5m30.0s

running (0m43.0s), 013/100 VUs, 123 complete and 0 interrupted iterations
throughput_ramp   [  13% ] 013/100 VUs  0m42.8s/5m30.0s

running (0m44.0s), 013/100 VUs, 126 complete and 0 interrupted iterations
throughput_ramp   [  13% ] 013/100 VUs  0m43.8s/5m30.0s

running (0m45.0s), 013/100 VUs, 130 complete and 0 interrupted iterations
throughput_ramp   [  14% ] 013/100 VUs  0m44.8s/5m30.0s

running (0m46.0s), 013/100 VUs, 135 complete and 0 interrupted iterations
throughput_ramp   [  14% ] 013/100 VUs  0m45.8s/5m30.0s

running (0m47.0s), 014/100 VUs, 139 complete and 0 interrupted iterations
throughput_ramp   [  14% ] 014/100 VUs  0m46.8s/5m30.0s

running (0m48.0s), 014/100 VUs, 141 complete and 0 interrupted iterations
throughput_ramp   [  14% ] 014/100 VUs  0m47.8s/5m30.0s

running (0m49.0s), 014/100 VUs, 143 complete and 0 interrupted iterations
throughput_ramp   [  15% ] 014/100 VUs  0m48.8s/5m30.0s

running (0m50.0s), 014/100 VUs, 151 complete and 0 interrupted iterations
throughput_ramp   [  15% ] 014/100 VUs  0m49.8s/5m30.0s

running (0m51.0s), 015/100 VUs, 155 complete and 0 interrupted iterations
throughput_ramp   [  15% ] 015/100 VUs  0m50.8s/5m30.0s

running (0m52.0s), 015/100 VUs, 155 complete and 0 interrupted iterations
throughput_ramp   [  16% ] 015/100 VUs  0m51.8s/5m30.0s

running (0m53.0s), 015/100 VUs, 161 complete and 0 interrupted iterations
throughput_ramp   [  16% ] 015/100 VUs  0m52.8s/5m30.0s

running (0m54.0s), 015/100 VUs, 166 complete and 0 interrupted iterations
throughput_ramp   [  16% ] 015/100 VUs  0m53.8s/5m30.0s

running (0m55.0s), 016/100 VUs, 169 complete and 0 interrupted iterations
throughput_ramp   [  17% ] 016/100 VUs  0m54.8s/5m30.0s

running (0m56.0s), 016/100 VUs, 172 complete and 0 interrupted iterations
throughput_ramp   [  17% ] 016/100 VUs  0m55.8s/5m30.0s

running (0m57.0s), 016/100 VUs, 174 complete and 0 interrupted iterations
throughput_ramp   [  17% ] 016/100 VUs  0m56.8s/5m30.0s

running (0m58.0s), 016/100 VUs, 179 complete and 0 interrupted iterations
throughput_ramp   [  18% ] 016/100 VUs  0m57.8s/5m30.0s

running (0m59.0s), 017/100 VUs, 184 complete and 0 interrupted iterations
throughput_ramp   [  18% ] 017/100 VUs  0m58.8s/5m30.0s

running (1m00.0s), 017/100 VUs, 191 complete and 0 interrupted iterations
throughput_ramp   [  18% ] 017/100 VUs  0m59.8s/5m30.0s

running (1m01.0s), 017/100 VUs, 194 complete and 0 interrupted iterations
throughput_ramp   [  18% ] 017/100 VUs  1m00.8s/5m30.0s

running (1m02.0s), 017/100 VUs, 197 complete and 0 interrupted iterations
throughput_ramp   [  19% ] 017/100 VUs  1m01.8s/5m30.0s

running (1m03.0s), 018/100 VUs, 198 complete and 0 interrupted iterations
throughput_ramp   [  19% ] 018/100 VUs  1m02.8s/5m30.0s

running (1m04.0s), 018/100 VUs, 203 complete and 0 interrupted iterations
throughput_ramp   [  19% ] 018/100 VUs  1m03.8s/5m30.0s

running (1m05.0s), 018/100 VUs, 212 complete and 0 interrupted iterations
throughput_ramp   [  20% ] 018/100 VUs  1m04.8s/5m30.0s

running (1m06.0s), 018/100 VUs, 214 complete and 0 interrupted iterations
throughput_ramp   [  20% ] 018/100 VUs  1m05.8s/5m30.0s

running (1m07.0s), 019/100 VUs, 216 complete and 0 interrupted iterations
throughput_ramp   [  20% ] 019/100 VUs  1m06.8s/5m30.0s

running (1m08.0s), 019/100 VUs, 217 complete and 0 interrupted iterations
throughput_ramp   [  21% ] 019/100 VUs  1m07.8s/5m30.0s

running (1m09.0s), 019/100 VUs, 221 complete and 0 interrupted iterations
throughput_ramp   [  21% ] 019/100 VUs  1m08.8s/5m30.0s

running (1m10.0s), 019/100 VUs, 229 complete and 0 interrupted iterations
throughput_ramp   [  21% ] 019/100 VUs  1m09.8s/5m30.0s

running (1m11.0s), 020/100 VUs, 232 complete and 0 interrupted iterations
throughput_ramp   [  21% ] 020/100 VUs  1m10.8s/5m30.0s

running (1m12.0s), 020/100 VUs, 236 complete and 0 interrupted iterations
throughput_ramp   [  22% ] 020/100 VUs  1m11.8s/5m30.0s

running (1m13.0s), 020/100 VUs, 238 complete and 0 interrupted iterations
throughput_ramp   [  22% ] 020/100 VUs  1m12.8s/5m30.0s

running (1m14.0s), 020/100 VUs, 240 complete and 0 interrupted iterations
throughput_ramp   [  22% ] 020/100 VUs  1m13.8s/5m30.0s

running (1m15.0s), 021/100 VUs, 246 complete and 0 interrupted iterations
throughput_ramp   [  23% ] 021/100 VUs  1m14.8s/5m30.0s

running (1m16.0s), 021/100 VUs, 252 complete and 0 interrupted iterations
throughput_ramp   [  23% ] 021/100 VUs  1m15.8s/5m30.0s

running (1m17.0s), 021/100 VUs, 257 complete and 0 interrupted iterations
throughput_ramp   [  23% ] 021/100 VUs  1m16.8s/5m30.0s

running (1m18.0s), 021/100 VUs, 261 complete and 0 interrupted iterations
throughput_ramp   [  24% ] 021/100 VUs  1m17.8s/5m30.0s

running (1m19.0s), 022/100 VUs, 262 complete and 0 interrupted iterations
throughput_ramp   [  24% ] 022/100 VUs  1m18.8s/5m30.0s

running (1m20.0s), 022/100 VUs, 265 complete and 0 interrupted iterations
throughput_ramp   [  24% ] 022/100 VUs  1m19.8s/5m30.0s

running (1m21.0s), 022/100 VUs, 271 complete and 0 interrupted iterations
throughput_ramp   [  24% ] 022/100 VUs  1m20.8s/5m30.0s

running (1m22.0s), 022/100 VUs, 275 complete and 0 interrupted iterations
throughput_ramp   [  25% ] 022/100 VUs  1m21.8s/5m30.0s

running (1m23.0s), 023/100 VUs, 283 complete and 0 interrupted iterations
throughput_ramp   [  25% ] 023/100 VUs  1m22.8s/5m30.0s

running (1m24.0s), 023/100 VUs, 284 complete and 0 interrupted iterations
throughput_ramp   [  25% ] 023/100 VUs  1m23.8s/5m30.0s

running (1m25.0s), 023/100 VUs, 286 complete and 0 interrupted iterations
throughput_ramp   [  26% ] 023/100 VUs  1m24.8s/5m30.0s

running (1m26.0s), 023/100 VUs, 287 complete and 0 interrupted iterations
throughput_ramp   [  26% ] 023/100 VUs  1m25.8s/5m30.0s

running (1m27.0s), 024/100 VUs, 292 complete and 0 interrupted iterations
throughput_ramp   [  26% ] 024/100 VUs  1m26.8s/5m30.0s

running (1m28.0s), 024/100 VUs, 295 complete and 0 interrupted iterations
throughput_ramp   [  27% ] 024/100 VUs  1m27.8s/5m30.0s

running (1m29.0s), 024/100 VUs, 302 complete and 0 interrupted iterations
throughput_ramp   [  27% ] 024/100 VUs  1m28.8s/5m30.0s

running (1m30.0s), 024/100 VUs, 304 complete and 0 interrupted iterations
throughput_ramp   [  27% ] 024/100 VUs  1m29.8s/5m30.0s

running (1m31.0s), 025/100 VUs, 309 complete and 0 interrupted iterations
throughput_ramp   [  28% ] 025/100 VUs  1m30.8s/5m30.0s

running (1m32.0s), 025/100 VUs, 312 complete and 0 interrupted iterations
throughput_ramp   [  28% ] 025/100 VUs  1m31.8s/5m30.0s

running (1m33.0s), 026/100 VUs, 318 complete and 0 interrupted iterations
throughput_ramp   [  28% ] 026/100 VUs  1m32.8s/5m30.0s

running (1m34.0s), 026/100 VUs, 320 complete and 0 interrupted iterations
throughput_ramp   [  28% ] 026/100 VUs  1m33.8s/5m30.0s

running (1m35.0s), 026/100 VUs, 329 complete and 0 interrupted iterations
throughput_ramp   [  29% ] 026/100 VUs  1m34.8s/5m30.0s

running (1m36.0s), 027/100 VUs, 333 complete and 0 interrupted iterations
throughput_ramp   [  29% ] 027/100 VUs  1m35.8s/5m30.0s

running (1m37.0s), 027/100 VUs, 335 complete and 0 interrupted iterations
throughput_ramp   [  29% ] 027/100 VUs  1m36.8s/5m30.0s

running (1m38.0s), 028/100 VUs, 336 complete and 0 interrupted iterations
throughput_ramp   [  30% ] 028/100 VUs  1m37.8s/5m30.0s

running (1m39.0s), 028/100 VUs, 338 complete and 0 interrupted iterations
throughput_ramp   [  30% ] 028/100 VUs  1m38.8s/5m30.0s

running (1m40.0s), 029/100 VUs, 343 complete and 0 interrupted iterations
throughput_ramp   [  30% ] 029/100 VUs  1m39.8s/5m30.0s

running (1m41.0s), 029/100 VUs, 346 complete and 0 interrupted iterations
throughput_ramp   [  31% ] 029/100 VUs  1m40.8s/5m30.0s

running (1m42.0s), 029/100 VUs, 355 complete and 0 interrupted iterations
throughput_ramp   [  31% ] 029/100 VUs  1m41.8s/5m30.0s

running (1m43.0s), 030/100 VUs, 357 complete and 0 interrupted iterations
throughput_ramp   [  31% ] 030/100 VUs  1m42.8s/5m30.0s

running (1m44.0s), 030/100 VUs, 358 complete and 0 interrupted iterations
throughput_ramp   [  31% ] 030/100 VUs  1m43.8s/5m30.0s

running (1m45.0s), 031/100 VUs, 358 complete and 0 interrupted iterations
throughput_ramp   [  32% ] 031/100 VUs  1m44.8s/5m30.0s

running (1m46.0s), 031/100 VUs, 362 complete and 0 interrupted iterations
throughput_ramp   [  32% ] 031/100 VUs  1m45.8s/5m30.0s

running (1m47.0s), 031/100 VUs, 368 complete and 0 interrupted iterations
throughput_ramp   [  32% ] 031/100 VUs  1m46.8s/5m30.0s

running (1m48.0s), 032/100 VUs, 377 complete and 0 interrupted iterations
throughput_ramp   [  33% ] 032/100 VUs  1m47.8s/5m30.0s

running (1m49.0s), 032/100 VUs, 384 complete and 0 interrupted iterations
throughput_ramp   [  33% ] 032/100 VUs  1m48.8s/5m30.0s

running (1m50.0s), 033/100 VUs, 388 complete and 0 interrupted iterations
throughput_ramp   [  33% ] 033/100 VUs  1m49.8s/5m30.0s

running (1m51.0s), 033/100 VUs, 389 complete and 0 interrupted iterations
throughput_ramp   [  34% ] 033/100 VUs  1m50.8s/5m30.0s

running (1m52.0s), 034/100 VUs, 389 complete and 0 interrupted iterations
throughput_ramp   [  34% ] 034/100 VUs  1m51.8s/5m30.0s

running (1m53.0s), 034/100 VUs, 393 complete and 0 interrupted iterations
throughput_ramp   [  34% ] 034/100 VUs  1m52.8s/5m30.0s

running (1m54.0s), 034/100 VUs, 399 complete and 0 interrupted iterations
throughput_ramp   [  34% ] 034/100 VUs  1m53.8s/5m30.0s

running (1m55.0s), 035/100 VUs, 407 complete and 0 interrupted iterations
throughput_ramp   [  35% ] 035/100 VUs  1m54.8s/5m30.0s

running (1m56.0s), 035/100 VUs, 410 complete and 0 interrupted iterations
throughput_ramp   [  35% ] 035/100 VUs  1m55.8s/5m30.0s

running (1m57.0s), 036/100 VUs, 416 complete and 0 interrupted iterations
throughput_ramp   [  35% ] 036/100 VUs  1m56.8s/5m30.0s

running (1m58.0s), 036/100 VUs, 417 complete and 0 interrupted iterations
throughput_ramp   [  36% ] 036/100 VUs  1m57.8s/5m30.0s

running (1m59.0s), 036/100 VUs, 418 complete and 0 interrupted iterations
throughput_ramp   [  36% ] 036/100 VUs  1m58.8s/5m30.0s

running (2m00.0s), 037/100 VUs, 418 complete and 0 interrupted iterations
throughput_ramp   [  36% ] 037/100 VUs  1m59.8s/5m30.0s

running (2m01.0s), 037/100 VUs, 424 complete and 0 interrupted iterations
throughput_ramp   [  37% ] 037/100 VUs  2m00.8s/5m30.0s

running (2m02.0s), 038/100 VUs, 432 complete and 0 interrupted iterations
throughput_ramp   [  37% ] 038/100 VUs  2m01.8s/5m30.0s

running (2m03.0s), 038/100 VUs, 437 complete and 0 interrupted iterations
throughput_ramp   [  37% ] 038/100 VUs  2m02.8s/5m30.0s

running (2m04.0s), 039/100 VUs, 443 complete and 0 interrupted iterations
throughput_ramp   [  38% ] 039/100 VUs  2m03.8s/5m30.0s

running (2m05.0s), 039/100 VUs, 448 complete and 0 interrupted iterations
throughput_ramp   [  38% ] 039/100 VUs  2m04.8s/5m30.0s

running (2m06.0s), 039/100 VUs, 450 complete and 0 interrupted iterations
throughput_ramp   [  38% ] 039/100 VUs  2m05.8s/5m30.0s

running (2m07.0s), 040/100 VUs, 452 complete and 0 interrupted iterations
throughput_ramp   [  38% ] 040/100 VUs  2m06.8s/5m30.0s

running (2m08.0s), 040/100 VUs, 454 complete and 0 interrupted iterations
throughput_ramp   [  39% ] 040/100 VUs  2m07.8s/5m30.0s

running (2m09.0s), 041/100 VUs, 455 complete and 0 interrupted iterations
throughput_ramp   [  39% ] 041/100 VUs  2m08.8s/5m30.0s

running (2m10.0s), 041/100 VUs, 460 complete and 0 interrupted iterations
throughput_ramp   [  39% ] 041/100 VUs  2m09.8s/5m30.0s

running (2m11.0s), 041/100 VUs, 467 complete and 0 interrupted iterations
throughput_ramp   [  40% ] 041/100 VUs  2m10.8s/5m30.0s

running (2m12.0s), 042/100 VUs, 473 complete and 0 interrupted iterations
throughput_ramp   [  40% ] 042/100 VUs  2m11.8s/5m30.0s

running (2m13.0s), 042/100 VUs, 479 complete and 0 interrupted iterations
throughput_ramp   [  40% ] 042/100 VUs  2m12.8s/5m30.0s

running (2m14.0s), 043/100 VUs, 482 complete and 0 interrupted iterations
throughput_ramp   [  41% ] 043/100 VUs  2m13.8s/5m30.0s

running (2m15.0s), 043/100 VUs, 485 complete and 0 interrupted iterations
throughput_ramp   [  41% ] 043/100 VUs  2m14.8s/5m30.0s

running (2m16.0s), 044/100 VUs, 487 complete and 0 interrupted iterations
throughput_ramp   [  41% ] 044/100 VUs  2m15.8s/5m30.0s

running (2m17.0s), 044/100 VUs, 489 complete and 0 interrupted iterations
throughput_ramp   [  41% ] 044/100 VUs  2m16.8s/5m30.0s

running (2m18.0s), 044/100 VUs, 492 complete and 0 interrupted iterations
throughput_ramp   [  42% ] 044/100 VUs  2m17.8s/5m30.0s

running (2m19.0s), 045/100 VUs, 495 complete and 0 interrupted iterations
throughput_ramp   [  42% ] 045/100 VUs  2m18.8s/5m30.0s

running (2m20.0s), 045/100 VUs, 500 complete and 0 interrupted iterations
throughput_ramp   [  42% ] 045/100 VUs  2m19.8s/5m30.0s

running (2m21.0s), 046/100 VUs, 503 complete and 0 interrupted iterations
throughput_ramp   [  43% ] 046/100 VUs  2m20.8s/5m30.0s

running (2m22.0s), 046/100 VUs, 509 complete and 0 interrupted iterations
throughput_ramp   [  43% ] 046/100 VUs  2m21.8s/5m30.0s

running (2m23.0s), 046/100 VUs, 519 complete and 0 interrupted iterations
throughput_ramp   [  43% ] 046/100 VUs  2m22.8s/5m30.0s

running (2m24.0s), 047/100 VUs, 526 complete and 0 interrupted iterations
throughput_ramp   [  44% ] 047/100 VUs  2m23.8s/5m30.0s

running (2m25.0s), 047/100 VUs, 529 complete and 0 interrupted iterations
throughput_ramp   [  44% ] 047/100 VUs  2m24.8s/5m30.0s

running (2m26.0s), 048/100 VUs, 531 complete and 0 interrupted iterations
throughput_ramp   [  44% ] 048/100 VUs  2m25.8s/5m30.0s

running (2m27.0s), 048/100 VUs, 531 complete and 0 interrupted iterations
throughput_ramp   [  44% ] 048/100 VUs  2m26.8s/5m30.0s

running (2m28.0s), 049/100 VUs, 533 complete and 0 interrupted iterations
throughput_ramp   [  45% ] 049/100 VUs  2m27.8s/5m30.0s

running (2m29.0s), 049/100 VUs, 537 complete and 0 interrupted iterations
throughput_ramp   [  45% ] 049/100 VUs  2m28.8s/5m30.0s

running (2m30.0s), 049/100 VUs, 542 complete and 0 interrupted iterations
throughput_ramp   [  45% ] 049/100 VUs  2m29.8s/5m30.0s

running (2m31.0s), 050/100 VUs, 546 complete and 0 interrupted iterations
throughput_ramp   [  46% ] 050/100 VUs  2m30.8s/5m30.0s

running (2m32.0s), 050/100 VUs, 557 complete and 0 interrupted iterations
throughput_ramp   [  46% ] 050/100 VUs  2m31.8s/5m30.0s

running (2m33.0s), 051/100 VUs, 557 complete and 0 interrupted iterations
throughput_ramp   [  46% ] 051/100 VUs  2m32.8s/5m30.0s

running (2m34.0s), 051/100 VUs, 561 complete and 0 interrupted iterations
throughput_ramp   [  47% ] 051/100 VUs  2m33.8s/5m30.0s

running (2m35.0s), 051/100 VUs, 565 complete and 0 interrupted iterations
throughput_ramp   [  47% ] 051/100 VUs  2m34.8s/5m30.0s

running (2m36.0s), 052/100 VUs, 568 complete and 0 interrupted iterations
throughput_ramp   [  47% ] 052/100 VUs  2m35.8s/5m30.0s

running (2m37.0s), 052/100 VUs, 570 complete and 0 interrupted iterations
throughput_ramp   [  48% ] 052/100 VUs  2m36.8s/5m30.0s

running (2m38.0s), 053/100 VUs, 573 complete and 0 interrupted iterations
throughput_ramp   [  48% ] 053/100 VUs  2m37.8s/5m30.0s

running (2m39.0s), 053/100 VUs, 576 complete and 0 interrupted iterations
throughput_ramp   [  48% ] 053/100 VUs  2m38.8s/5m30.0s

running (2m40.0s), 054/100 VUs, 578 complete and 0 interrupted iterations
throughput_ramp   [  48% ] 054/100 VUs  2m39.8s/5m30.0s

running (2m41.0s), 054/100 VUs, 583 complete and 0 interrupted iterations
throughput_ramp   [  49% ] 054/100 VUs  2m40.8s/5m30.0s

running (2m42.0s), 054/100 VUs, 589 complete and 0 interrupted iterations
throughput_ramp   [  49% ] 054/100 VUs  2m41.8s/5m30.0s

running (2m43.0s), 055/100 VUs, 593 complete and 0 interrupted iterations
throughput_ramp   [  49% ] 055/100 VUs  2m42.8s/5m30.0s

running (2m44.0s), 055/100 VUs, 597 complete and 0 interrupted iterations
throughput_ramp   [  50% ] 055/100 VUs  2m43.8s/5m30.0s

running (2m45.0s), 056/100 VUs, 602 complete and 0 interrupted iterations
throughput_ramp   [  50% ] 056/100 VUs  2m44.8s/5m30.0s

running (2m46.0s), 056/100 VUs, 609 complete and 0 interrupted iterations
throughput_ramp   [  50% ] 056/100 VUs  2m45.8s/5m30.0s

running (2m47.0s), 056/100 VUs, 615 complete and 0 interrupted iterations
throughput_ramp   [  51% ] 056/100 VUs  2m46.8s/5m30.0s

running (2m48.0s), 057/100 VUs, 617 complete and 0 interrupted iterations
throughput_ramp   [  51% ] 057/100 VUs  2m47.8s/5m30.0s

running (2m49.0s), 057/100 VUs, 620 complete and 0 interrupted iterations
throughput_ramp   [  51% ] 057/100 VUs  2m48.8s/5m30.0s

running (2m50.0s), 058/100 VUs, 626 complete and 0 interrupted iterations
throughput_ramp   [  51% ] 058/100 VUs  2m49.8s/5m30.0s

running (2m51.0s), 058/100 VUs, 631 complete and 0 interrupted iterations
throughput_ramp   [  52% ] 058/100 VUs  2m50.8s/5m30.0s

running (2m52.0s), 059/100 VUs, 634 complete and 0 interrupted iterations
throughput_ramp   [  52% ] 059/100 VUs  2m51.8s/5m30.0s

running (2m53.0s), 059/100 VUs, 640 complete and 0 interrupted iterations
throughput_ramp   [  52% ] 059/100 VUs  2m52.8s/5m30.0s

running (2m54.0s), 059/100 VUs, 647 complete and 0 interrupted iterations
throughput_ramp   [  53% ] 059/100 VUs  2m53.8s/5m30.0s

running (2m55.0s), 060/100 VUs, 649 complete and 0 interrupted iterations
throughput_ramp   [  53% ] 060/100 VUs  2m54.8s/5m30.0s

running (2m56.0s), 060/100 VUs, 654 complete and 0 interrupted iterations
throughput_ramp   [  53% ] 060/100 VUs  2m55.8s/5m30.0s

running (2m57.0s), 061/100 VUs, 654 complete and 0 interrupted iterations
throughput_ramp   [  54% ] 061/100 VUs  2m56.8s/5m30.0s

running (2m58.0s), 061/100 VUs, 656 complete and 0 interrupted iterations
throughput_ramp   [  54% ] 061/100 VUs  2m57.8s/5m30.0s

running (2m59.0s), 061/100 VUs, 663 complete and 0 interrupted iterations
throughput_ramp   [  54% ] 061/100 VUs  2m58.8s/5m30.0s

running (3m00.0s), 062/100 VUs, 671 complete and 0 interrupted iterations
throughput_ramp   [  54% ] 062/100 VUs  2m59.8s/5m30.0s

running (3m01.0s), 062/100 VUs, 673 complete and 0 interrupted iterations
throughput_ramp   [  55% ] 062/100 VUs  3m00.8s/5m30.0s

running (3m02.0s), 063/100 VUs, 674 complete and 0 interrupted iterations
throughput_ramp   [  55% ] 063/100 VUs  3m01.8s/5m30.0s

running (3m03.0s), 063/100 VUs, 675 complete and 0 interrupted iterations
throughput_ramp   [  55% ] 063/100 VUs  3m02.8s/5m30.0s

running (3m04.0s), 064/100 VUs, 677 complete and 0 interrupted iterations
throughput_ramp   [  56% ] 064/100 VUs  3m03.8s/5m30.0s

running (3m05.0s), 064/100 VUs, 680 complete and 0 interrupted iterations
throughput_ramp   [  56% ] 064/100 VUs  3m04.8s/5m30.0s

running (3m06.0s), 064/100 VUs, 685 complete and 0 interrupted iterations
throughput_ramp   [  56% ] 064/100 VUs  3m05.8s/5m30.0s

running (3m07.0s), 065/100 VUs, 693 complete and 0 interrupted iterations
throughput_ramp   [  57% ] 065/100 VUs  3m06.8s/5m30.0s

running (3m08.0s), 065/100 VUs, 698 complete and 0 interrupted iterations
throughput_ramp   [  57% ] 065/100 VUs  3m07.8s/5m30.0s

running (3m09.0s), 066/100 VUs, 702 complete and 0 interrupted iterations
throughput_ramp   [  57% ] 066/100 VUs  3m08.8s/5m30.0s

running (3m10.0s), 066/100 VUs, 706 complete and 0 interrupted iterations
throughput_ramp   [  58% ] 066/100 VUs  3m09.8s/5m30.0s

running (3m11.0s), 066/100 VUs, 708 complete and 0 interrupted iterations
throughput_ramp   [  58% ] 066/100 VUs  3m10.8s/5m30.0s

running (3m12.0s), 067/100 VUs, 714 complete and 0 interrupted iterations
throughput_ramp   [  58% ] 067/100 VUs  3m11.8s/5m30.0s

running (3m13.0s), 067/100 VUs, 717 complete and 0 interrupted iterations
throughput_ramp   [  58% ] 067/100 VUs  3m12.8s/5m30.0s

running (3m14.0s), 068/100 VUs, 720 complete and 0 interrupted iterations
throughput_ramp   [  59% ] 068/100 VUs  3m13.8s/5m30.0s

running (3m15.0s), 068/100 VUs, 721 complete and 0 interrupted iterations
throughput_ramp   [  59% ] 068/100 VUs  3m14.8s/5m30.0s

running (3m16.0s), 069/100 VUs, 728 complete and 0 interrupted iterations
throughput_ramp   [  59% ] 069/100 VUs  3m15.8s/5m30.0s

running (3m17.0s), 069/100 VUs, 732 complete and 0 interrupted iterations
throughput_ramp   [  60% ] 069/100 VUs  3m16.8s/5m30.0s

running (3m18.0s), 069/100 VUs, 737 complete and 0 interrupted iterations
throughput_ramp   [  60% ] 069/100 VUs  3m17.8s/5m30.0s

running (3m19.0s), 070/100 VUs, 741 complete and 0 interrupted iterations
throughput_ramp   [  60% ] 070/100 VUs  3m18.8s/5m30.0s

running (3m20.0s), 070/100 VUs, 742 complete and 0 interrupted iterations
throughput_ramp   [  61% ] 070/100 VUs  3m19.8s/5m30.0s

running (3m21.0s), 071/100 VUs, 744 complete and 0 interrupted iterations
throughput_ramp   [  61% ] 071/100 VUs  3m20.8s/5m30.0s

running (3m22.0s), 071/100 VUs, 748 complete and 0 interrupted iterations
throughput_ramp   [  61% ] 071/100 VUs  3m21.8s/5m30.0s

running (3m23.0s), 071/100 VUs, 756 complete and 0 interrupted iterations
throughput_ramp   [  61% ] 071/100 VUs  3m22.8s/5m30.0s

running (3m24.0s), 072/100 VUs, 762 complete and 0 interrupted iterations
throughput_ramp   [  62% ] 072/100 VUs  3m23.8s/5m30.0s

running (3m25.0s), 072/100 VUs, 767 complete and 0 interrupted iterations
throughput_ramp   [  62% ] 072/100 VUs  3m24.8s/5m30.0s

running (3m26.0s), 073/100 VUs, 771 complete and 0 interrupted iterations
throughput_ramp   [  62% ] 073/100 VUs  3m25.8s/5m30.0s

running (3m27.0s), 073/100 VUs, 779 complete and 0 interrupted iterations
throughput_ramp   [  63% ] 073/100 VUs  3m26.8s/5m30.0s

running (3m28.0s), 074/100 VUs, 783 complete and 0 interrupted iterations
throughput_ramp   [  63% ] 074/100 VUs  3m27.8s/5m30.0s

running (3m29.0s), 074/100 VUs, 789 complete and 0 interrupted iterations
throughput_ramp   [  63% ] 074/100 VUs  3m28.8s/5m30.0s

running (3m30.0s), 074/100 VUs, 792 complete and 0 interrupted iterations
throughput_ramp   [  64% ] 074/100 VUs  3m29.8s/5m30.0s

running (3m31.0s), 075/100 VUs, 793 complete and 0 interrupted iterations
throughput_ramp   [  64% ] 075/100 VUs  3m30.8s/5m30.0s

running (3m32.0s), 075/100 VUs, 797 complete and 0 interrupted iterations
throughput_ramp   [  64% ] 075/100 VUs  3m31.8s/5m30.0s

running (3m33.0s), 076/100 VUs, 800 complete and 0 interrupted iterations
throughput_ramp   [  64% ] 076/100 VUs  3m32.8s/5m30.0s

running (3m34.0s), 076/100 VUs, 805 complete and 0 interrupted iterations
throughput_ramp   [  65% ] 076/100 VUs  3m33.8s/5m30.0s

running (3m35.0s), 076/100 VUs, 808 complete and 0 interrupted iterations
throughput_ramp   [  65% ] 076/100 VUs  3m34.8s/5m30.0s

running (3m36.0s), 077/100 VUs, 810 complete and 0 interrupted iterations
throughput_ramp   [  65% ] 077/100 VUs  3m35.8s/5m30.0s

running (3m37.0s), 077/100 VUs, 814 complete and 0 interrupted iterations
throughput_ramp   [  66% ] 077/100 VUs  3m36.8s/5m30.0s

running (3m38.0s), 078/100 VUs, 818 complete and 0 interrupted iterations
throughput_ramp   [  66% ] 078/100 VUs  3m37.8s/5m30.0s

running (3m39.0s), 078/100 VUs, 822 complete and 0 interrupted iterations
throughput_ramp   [  66% ] 078/100 VUs  3m38.8s/5m30.0s

running (3m40.0s), 079/100 VUs, 830 complete and 0 interrupted iterations
throughput_ramp   [  67% ] 079/100 VUs  3m39.8s/5m30.0s

running (3m41.0s), 079/100 VUs, 835 complete and 0 interrupted iterations
throughput_ramp   [  67% ] 079/100 VUs  3m40.8s/5m30.0s

running (3m42.0s), 079/100 VUs, 839 complete and 0 interrupted iterations
throughput_ramp   [  67% ] 079/100 VUs  3m41.8s/5m30.0s

running (3m43.0s), 080/100 VUs, 846 complete and 0 interrupted iterations
throughput_ramp   [  68% ] 080/100 VUs  3m42.8s/5m30.0s

running (3m44.0s), 080/100 VUs, 852 complete and 0 interrupted iterations
throughput_ramp   [  68% ] 080/100 VUs  3m43.8s/5m30.0s

running (3m45.0s), 081/100 VUs, 855 complete and 0 interrupted iterations
throughput_ramp   [  68% ] 081/100 VUs  3m44.8s/5m30.0s

running (3m46.0s), 081/100 VUs, 858 complete and 0 interrupted iterations
throughput_ramp   [  68% ] 081/100 VUs  3m45.8s/5m30.0s

running (3m47.0s), 081/100 VUs, 862 complete and 0 interrupted iterations
throughput_ramp   [  69% ] 081/100 VUs  3m46.8s/5m30.0s

running (3m48.0s), 082/100 VUs, 866 complete and 0 interrupted iterations
throughput_ramp   [  69% ] 082/100 VUs  3m47.8s/5m30.0s

running (3m49.0s), 082/100 VUs, 871 complete and 0 interrupted iterations
throughput_ramp   [  69% ] 082/100 VUs  3m48.8s/5m30.0s

running (3m50.0s), 083/100 VUs, 877 complete and 0 interrupted iterations
throughput_ramp   [  70% ] 083/100 VUs  3m49.8s/5m30.0s

running (3m51.0s), 083/100 VUs, 882 complete and 0 interrupted iterations
throughput_ramp   [  70% ] 083/100 VUs  3m50.8s/5m30.0s

running (3m52.0s), 084/100 VUs, 892 complete and 0 interrupted iterations
throughput_ramp   [  70% ] 084/100 VUs  3m51.8s/5m30.0s

running (3m53.0s), 084/100 VUs, 893 complete and 0 interrupted iterations
throughput_ramp   [  71% ] 084/100 VUs  3m52.8s/5m30.0s

running (3m54.0s), 084/100 VUs, 896 complete and 0 interrupted iterations
throughput_ramp   [  71% ] 084/100 VUs  3m53.8s/5m30.0s

running (3m55.0s), 085/100 VUs, 904 complete and 0 interrupted iterations
throughput_ramp   [  71% ] 085/100 VUs  3m54.8s/5m30.0s

running (3m56.0s), 085/100 VUs, 908 complete and 0 interrupted iterations
throughput_ramp   [  71% ] 085/100 VUs  3m55.8s/5m30.0s

running (3m57.0s), 086/100 VUs, 914 complete and 0 interrupted iterations
throughput_ramp   [  72% ] 086/100 VUs  3m56.8s/5m30.0s

running (3m58.0s), 086/100 VUs, 918 complete and 0 interrupted iterations
throughput_ramp   [  72% ] 086/100 VUs  3m57.8s/5m30.0s

running (3m59.0s), 086/100 VUs, 920 complete and 0 interrupted iterations
throughput_ramp   [  72% ] 086/100 VUs  3m58.8s/5m30.0s

running (4m00.0s), 087/100 VUs, 927 complete and 0 interrupted iterations
throughput_ramp   [  73% ] 087/100 VUs  3m59.8s/5m30.0s

running (4m01.0s), 087/100 VUs, 932 complete and 0 interrupted iterations
throughput_ramp   [  73% ] 087/100 VUs  4m00.8s/5m30.0s

running (4m02.0s), 088/100 VUs, 934 complete and 0 interrupted iterations
throughput_ramp   [  73% ] 088/100 VUs  4m01.8s/5m30.0s

running (4m03.0s), 088/100 VUs, 938 complete and 0 interrupted iterations
throughput_ramp   [  74% ] 088/100 VUs  4m02.8s/5m30.0s

running (4m04.0s), 089/100 VUs, 940 complete and 0 interrupted iterations
throughput_ramp   [  74% ] 089/100 VUs  4m03.8s/5m30.0s

running (4m05.0s), 089/100 VUs, 942 complete and 0 interrupted iterations
throughput_ramp   [  74% ] 089/100 VUs  4m04.8s/5m30.0s

running (4m06.0s), 089/100 VUs, 944 complete and 0 interrupted iterations
throughput_ramp   [  74% ] 089/100 VUs  4m05.8s/5m30.0s

running (4m07.0s), 090/100 VUs, 947 complete and 0 interrupted iterations
throughput_ramp   [  75% ] 090/100 VUs  4m06.8s/5m30.0s

running (4m08.0s), 090/100 VUs, 949 complete and 0 interrupted iterations
throughput_ramp   [  75% ] 090/100 VUs  4m07.8s/5m30.0s

running (4m09.0s), 091/100 VUs, 956 complete and 0 interrupted iterations
throughput_ramp   [  75% ] 091/100 VUs  4m08.8s/5m30.0s

running (4m10.0s), 091/100 VUs, 959 complete and 0 interrupted iterations
throughput_ramp   [  76% ] 091/100 VUs  4m09.8s/5m30.0s

running (4m11.0s), 091/100 VUs, 967 complete and 0 interrupted iterations
throughput_ramp   [  76% ] 091/100 VUs  4m10.8s/5m30.0s

running (4m12.0s), 092/100 VUs, 970 complete and 0 interrupted iterations
throughput_ramp   [  76% ] 092/100 VUs  4m11.8s/5m30.0s

running (4m13.0s), 092/100 VUs, 975 complete and 0 interrupted iterations
throughput_ramp   [  77% ] 092/100 VUs  4m12.8s/5m30.0s

running (4m14.0s), 093/100 VUs, 977 complete and 0 interrupted iterations
throughput_ramp   [  77% ] 093/100 VUs  4m13.8s/5m30.0s

running (4m15.0s), 093/100 VUs, 982 complete and 0 interrupted iterations
throughput_ramp   [  77% ] 093/100 VUs  4m14.8s/5m30.0s

running (4m16.0s), 094/100 VUs, 987 complete and 0 interrupted iterations
throughput_ramp   [  78% ] 094/100 VUs  4m15.8s/5m30.0s

running (4m17.0s), 094/100 VUs, 991 complete and 0 interrupted iterations
throughput_ramp   [  78% ] 094/100 VUs  4m16.8s/5m30.0s

running (4m18.0s), 094/100 VUs, 998 complete and 0 interrupted iterations
throughput_ramp   [  78% ] 094/100 VUs  4m17.8s/5m30.0s

running (4m19.0s), 095/100 VUs, 1002 complete and 0 interrupted iterations
throughput_ramp   [  78% ] 095/100 VUs  4m18.8s/5m30.0s

running (4m20.0s), 095/100 VUs, 1004 complete and 0 interrupted iterations
throughput_ramp   [  79% ] 095/100 VUs  4m19.8s/5m30.0s

running (4m21.0s), 096/100 VUs, 1007 complete and 0 interrupted iterations
throughput_ramp   [  79% ] 096/100 VUs  4m20.8s/5m30.0s

running (4m22.0s), 096/100 VUs, 1011 complete and 0 interrupted iterations
throughput_ramp   [  79% ] 096/100 VUs  4m21.8s/5m30.0s

running (4m23.0s), 096/100 VUs, 1017 complete and 0 interrupted iterations
throughput_ramp   [  80% ] 096/100 VUs  4m22.8s/5m30.0s

running (4m24.0s), 097/100 VUs, 1019 complete and 0 interrupted iterations
throughput_ramp   [  80% ] 097/100 VUs  4m23.8s/5m30.0s

running (4m25.0s), 097/100 VUs, 1021 complete and 0 interrupted iterations
throughput_ramp   [  80% ] 097/100 VUs  4m24.8s/5m30.0s

running (4m26.0s), 098/100 VUs, 1027 complete and 0 interrupted iterations
throughput_ramp   [  81% ] 098/100 VUs  4m25.8s/5m30.0s

running (4m27.0s), 098/100 VUs, 1028 complete and 0 interrupted iterations
throughput_ramp   [  81% ] 098/100 VUs  4m26.8s/5m30.0s

running (4m28.0s), 099/100 VUs, 1034 complete and 0 interrupted iterations
throughput_ramp   [  81% ] 099/100 VUs  4m27.8s/5m30.0s

running (4m29.0s), 099/100 VUs, 1036 complete and 0 interrupted iterations
throughput_ramp   [  81% ] 099/100 VUs  4m28.8s/5m30.0s

running (4m30.0s), 099/100 VUs, 1039 complete and 0 interrupted iterations
throughput_ramp   [  82% ] 099/100 VUs  4m29.8s/5m30.0s

running (4m31.0s), 100/100 VUs, 1040 complete and 0 interrupted iterations
throughput_ramp   [  82% ] 100/100 VUs  4m30.8s/5m30.0s

running (4m32.0s), 100/100 VUs, 1047 complete and 0 interrupted iterations
throughput_ramp   [  82% ] 100/100 VUs  4m31.8s/5m30.0s

running (4m33.0s), 100/100 VUs, 1050 complete and 0 interrupted iterations
throughput_ramp   [  83% ] 100/100 VUs  4m32.8s/5m30.0s

running (4m34.0s), 100/100 VUs, 1056 complete and 0 interrupted iterations
throughput_ramp   [  83% ] 100/100 VUs  4m33.8s/5m30.0s

running (4m35.0s), 100/100 VUs, 1060 complete and 0 interrupted iterations
throughput_ramp   [  83% ] 100/100 VUs  4m34.8s/5m30.0s

running (4m36.0s), 100/100 VUs, 1062 complete and 0 interrupted iterations
throughput_ramp   [  84% ] 100/100 VUs  4m35.8s/5m30.0s

running (4m37.0s), 099/100 VUs, 1069 complete and 0 interrupted iterations
throughput_ramp   [  84% ] 099/100 VUs  4m36.8s/5m30.0s

running (4m38.0s), 099/100 VUs, 1071 complete and 0 interrupted iterations
throughput_ramp   [  84% ] 099/100 VUs  4m37.8s/5m30.0s

running (4m39.0s), 099/100 VUs, 1076 complete and 0 interrupted iterations
throughput_ramp   [  84% ] 099/100 VUs  4m38.8s/5m30.0s

running (4m40.0s), 098/100 VUs, 1081 complete and 0 interrupted iterations
throughput_ramp   [  85% ] 098/100 VUs  4m39.8s/5m30.0s

running (4m41.0s), 097/100 VUs, 1088 complete and 0 interrupted iterations
throughput_ramp   [  85% ] 097/100 VUs  4m40.8s/5m30.0s

running (4m42.0s), 095/100 VUs, 1095 complete and 0 interrupted iterations
throughput_ramp   [  85% ] 095/100 VUs  4m41.8s/5m30.0s

running (4m43.0s), 095/100 VUs, 1097 complete and 0 interrupted iterations
throughput_ramp   [  86% ] 095/100 VUs  4m42.8s/5m30.0s

running (4m44.0s), 095/100 VUs, 1099 complete and 0 interrupted iterations
throughput_ramp   [  86% ] 095/100 VUs  4m43.8s/5m30.0s

running (4m45.0s), 095/100 VUs, 1104 complete and 0 interrupted iterations
throughput_ramp   [  86% ] 095/100 VUs  4m44.8s/5m30.0s

running (4m46.0s), 095/100 VUs, 1105 complete and 0 interrupted iterations
throughput_ramp   [  87% ] 095/100 VUs  4m45.8s/5m30.0s

running (4m47.0s), 093/100 VUs, 1110 complete and 0 interrupted iterations
throughput_ramp   [  87% ] 093/100 VUs  4m46.8s/5m30.0s

running (4m48.0s), 091/100 VUs, 1112 complete and 0 interrupted iterations
throughput_ramp   [  87% ] 091/100 VUs  4m47.8s/5m30.0s

running (4m49.0s), 087/100 VUs, 1120 complete and 0 interrupted iterations
throughput_ramp   [  88% ] 087/100 VUs  4m48.8s/5m30.0s

running (4m50.0s), 086/100 VUs, 1125 complete and 0 interrupted iterations
throughput_ramp   [  88% ] 086/100 VUs  4m49.8s/5m30.0s

running (4m51.0s), 084/100 VUs, 1129 complete and 0 interrupted iterations
throughput_ramp   [  88% ] 084/100 VUs  4m50.8s/5m30.0s

running (4m52.0s), 083/100 VUs, 1135 complete and 0 interrupted iterations
throughput_ramp   [  88% ] 083/100 VUs  4m51.8s/5m30.0s

running (4m53.0s), 081/100 VUs, 1141 complete and 0 interrupted iterations
throughput_ramp   [  89% ] 081/100 VUs  4m52.8s/5m30.0s

running (4m54.0s), 079/100 VUs, 1147 complete and 0 interrupted iterations
throughput_ramp   [  89% ] 079/100 VUs  4m53.8s/5m30.0s

running (4m55.0s), 079/100 VUs, 1149 complete and 0 interrupted iterations
throughput_ramp   [  89% ] 079/100 VUs  4m54.8s/5m30.0s

running (4m56.0s), 076/100 VUs, 1153 complete and 0 interrupted iterations
throughput_ramp   [  90% ] 076/100 VUs  4m55.8s/5m30.0s

running (4m57.0s), 076/100 VUs, 1154 complete and 0 interrupted iterations
throughput_ramp   [  90% ] 076/100 VUs  4m56.8s/5m30.0s

running (4m58.0s), 074/100 VUs, 1158 complete and 0 interrupted iterations
throughput_ramp   [  90% ] 074/100 VUs  4m57.8s/5m30.0s

running (4m59.0s), 073/100 VUs, 1162 complete and 0 interrupted iterations
throughput_ramp   [  91% ] 073/100 VUs  4m58.8s/5m30.0s

running (5m00.0s), 072/100 VUs, 1167 complete and 0 interrupted iterations
throughput_ramp   [  91% ] 072/100 VUs  4m59.8s/5m30.0s

running (5m01.0s), 070/100 VUs, 1173 complete and 0 interrupted iterations
throughput_ramp   [  91% ] 070/100 VUs  5m00.8s/5m30.0s

running (5m02.0s), 069/100 VUs, 1175 complete and 0 interrupted iterations
throughput_ramp   [  91% ] 069/100 VUs  5m01.8s/5m30.0s

running (5m03.0s), 064/100 VUs, 1181 complete and 0 interrupted iterations
throughput_ramp   [  92% ] 064/100 VUs  5m02.8s/5m30.0s

running (5m04.0s), 062/100 VUs, 1185 complete and 0 interrupted iterations
throughput_ramp   [  92% ] 062/100 VUs  5m03.8s/5m30.0s

running (5m05.0s), 061/100 VUs, 1188 complete and 0 interrupted iterations
throughput_ramp   [  92% ] 061/100 VUs  5m04.8s/5m30.0s

running (5m06.0s), 061/100 VUs, 1191 complete and 0 interrupted iterations
throughput_ramp   [  93% ] 061/100 VUs  5m05.8s/5m30.0s

running (5m07.0s), 058/100 VUs, 1195 complete and 0 interrupted iterations
throughput_ramp   [  93% ] 058/100 VUs  5m06.8s/5m30.0s

running (5m08.0s), 058/100 VUs, 1199 complete and 0 interrupted iterations
throughput_ramp   [  93% ] 058/100 VUs  5m07.8s/5m30.0s

running (5m09.0s), 054/100 VUs, 1203 complete and 0 interrupted iterations
throughput_ramp   [  94% ] 054/100 VUs  5m08.8s/5m30.0s

running (5m10.0s), 053/100 VUs, 1210 complete and 0 interrupted iterations
throughput_ramp   [  94% ] 053/100 VUs  5m09.8s/5m30.0s

running (5m11.0s), 050/100 VUs, 1215 complete and 0 interrupted iterations
throughput_ramp   [  94% ] 050/100 VUs  5m10.8s/5m30.0s

running (5m12.0s), 048/100 VUs, 1220 complete and 0 interrupted iterations
throughput_ramp   [  94% ] 048/100 VUs  5m11.8s/5m30.0s

running (5m13.0s), 047/100 VUs, 1223 complete and 0 interrupted iterations
throughput_ramp   [  95% ] 047/100 VUs  5m12.8s/5m30.0s

running (5m14.0s), 046/100 VUs, 1228 complete and 0 interrupted iterations
throughput_ramp   [  95% ] 046/100 VUs  5m13.8s/5m30.0s

running (5m15.0s), 043/100 VUs, 1231 complete and 0 interrupted iterations
throughput_ramp   [  95% ] 043/100 VUs  5m14.8s/5m30.0s

running (5m16.0s), 038/100 VUs, 1237 complete and 0 interrupted iterations
throughput_ramp   [  96% ] 038/100 VUs  5m15.8s/5m30.0s

running (5m17.0s), 033/100 VUs, 1242 complete and 0 interrupted iterations
throughput_ramp   [  96% ] 033/100 VUs  5m16.8s/5m30.0s

running (5m18.0s), 032/100 VUs, 1244 complete and 0 interrupted iterations
throughput_ramp   [  96% ] 032/100 VUs  5m17.8s/5m30.0s

running (5m19.0s), 031/100 VUs, 1246 complete and 0 interrupted iterations
throughput_ramp   [  97% ] 031/100 VUs  5m18.8s/5m30.0s

running (5m20.0s), 029/100 VUs, 1251 complete and 0 interrupted iterations
throughput_ramp   [  97% ] 029/100 VUs  5m19.8s/5m30.0s

running (5m21.0s), 026/100 VUs, 1256 complete and 0 interrupted iterations
throughput_ramp   [  97% ] 026/100 VUs  5m20.8s/5m30.0s

running (5m22.0s), 024/100 VUs, 1259 complete and 0 interrupted iterations
throughput_ramp   [  98% ] 024/100 VUs  5m21.8s/5m30.0s

running (5m23.0s), 020/100 VUs, 1264 complete and 0 interrupted iterations
throughput_ramp   [  98% ] 020/100 VUs  5m22.8s/5m30.0s

running (5m24.0s), 018/100 VUs, 1268 complete and 0 interrupted iterations
throughput_ramp   [  98% ] 018/100 VUs  5m23.8s/5m30.0s

running (5m25.0s), 015/100 VUs, 1271 complete and 0 interrupted iterations
throughput_ramp   [  98% ] 015/100 VUs  5m24.8s/5m30.0s

running (5m26.0s), 012/100 VUs, 1277 complete and 0 interrupted iterations
throughput_ramp   [  99% ] 012/100 VUs  5m25.8s/5m30.0s

running (5m27.0s), 010/100 VUs, 1280 complete and 0 interrupted iterations
throughput_ramp   [  99% ] 010/100 VUs  5m26.8s/5m30.0s

running (5m28.0s), 009/100 VUs, 1282 complete and 0 interrupted iterations
throughput_ramp   [  99% ] 009/100 VUs  5m27.8s/5m30.0s

running (5m29.0s), 005/100 VUs, 1289 complete and 0 interrupted iterations
throughput_ramp   [ 100% ] 005/100 VUs  5m28.8s/5m30.0s

running (5m30.0s), 002/100 VUs, 1292 complete and 0 interrupted iterations
throughput_ramp   [ 100% ] 002/100 VUs  5m29.8s/5m30.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<15000' p(95)=4.78s

    throughput_errors
    ✓ 'rate<0.3' rate=9.96%


  █ TOTAL RESULTS 

    checks_total.......: 1294    3.916378/s
    checks_succeeded...: 100.00% 1294 out of 1294
    checks_failed......: 0.00%   0 out of 1294

    ✓ Advanced full workflow ok
    ✓ DataExchange full workflow ok
    ✓ MLTrainer full workflow ok
    ✓ MonteCarlo full workflow ok
    ✓ Calculator full workflow ok
    ✓ Geospatial full workflow ok
    ✓ Analytics full workflow ok
    ✓ ClimateAnomaly full workflow ok

    CUSTOM
    throughput_errors..............: 9.96%  645 out of 6470
    throughput_ops.................: 6470   19.58189/s
    throughput_response_ms.........: avg=1.66s  min=32.34ms med=1.21s max=10.66s p(90)=4.01s  p(95)=5.04s 

    HTTP
    http_req_duration..............: avg=1.64s  min=32.34ms med=1.29s max=10.66s p(90)=3.77s  p(95)=4.78s 
      { expected_response:true }...: avg=1.65s  min=32.34ms med=1.3s  max=9.64s  p(90)=3.78s  p(95)=4.79s 
    http_req_failed................: 7.11%  645 out of 9060
    http_reqs......................: 9060   27.420699/s

    EXECUTION
    iteration_duration.............: avg=12.51s min=1.56s   med=12.2s max=37.03s p(90)=22.75s p(95)=25.02s
    iterations.....................: 1294   3.916378/s
    vus............................: 2      min=0           max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 245 MB 743 kB/s
    data_sent......................: 2.9 MB 8.6 kB/s



running (5m30.4s), 000/100 VUs, 1294 complete and 0 interrupted iterations
throughput_ramp ✓ [ 100% ] 000/100 VUs  5m30s